Revit 2026 API

# CableTraySizesRemoveSize Method

---

Erases the existing MEPSize. For cable tray, the nominal diameter is used in MEPSize.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSize(
	MEPSize sizeInfo
)
```
```vb
Public Sub RemoveSize (
	sizeInfo As MEPSize
)
```
```cpp
public:
void RemoveSize(
	MEPSize^ sizeInfo
)
```
```fsharp
member RemoveSize :
        sizeInfo : MEPSize -> unit
```

#### Parameters

sizeInfo MEPSize
     The MEPSize to be removed..

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Throws if the function is called during iterating the size set. |

Does nothing if there is no existing MEPSize with the specified nominal diameter.

#### Reference

CableTraySizes Class

Autodesk.Revit.DB.Electrical Namespace